In [2]:
import pandas as pd
albums_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/0-multi-tables/albums.csv"
albums_df = pd.read_csv(albums_url)
artists_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/0-multi-tables/artists.csv"
artists_df = pd.read_csv(artists_url)

In [3]:
import sqlite3
conn = sqlite3.connect('billboard.db')

In [4]:
albums_df.to_sql('albums', conn, index = False)
artists_df.to_sql('artists', conn, index = False)

In [5]:
cursor = conn.cursor()

In [9]:
pd.read_sql('select * from artists', conn)

   id        name
0   1  Paul Simon
1   2      Prince

In [8]:
pd.read_sql('select * from albums', conn)

   id        date  artist_id  title      rank  length             track_length
0   1  2019-01-19          2     17  256500.0       1  The Very Best Of Prince
1   2  2017-06-03          2     40  233901.0       1                    4Ever
2   3  2016-07-16          1     11  202174.0       2     Stranger To Stranger

In [13]:
pd.read_sql("""SELECT * from albums 
            JOIN artists ON artists.id = albums.artist_id 
            WHERE artists.name = 'Paul Simon'
            """, conn)

,id,date,artist_id,title,rank,length,track_length,id,name
0,3,2016-07-16,1,11,202174.0,2,Stranger To Stranger,1,Paul Simon